{
  "settings": [
    {
      "id": "adapt_alt",
      "name": "Adapt altitude",
      "description": "Select if you want to add an adapted altitude variable to your data. The algorithm will detect your altitude variable by the names partly being 'height' or 'altitude'. The adapted variable will be called as the original one with '.adapted' added to the name. In addition output histogrammes with individual adapted altitude distributions and a table with mean and standard deviation adapted altitude per individual and overall will be generated.",
      "defaultValue": false,
      "type": "CHECKBOX"
    },
	{
      "id": "height_props",
      "name": "Height thresholds for proportional use",
      "description": "Insert the required adapted heights/altitudes (in metre) for which the usage proportions shall be calculated. Values must be positive. If you want more than one height, enter them in ascending order and seperate by comma. Example: 100,200,300,500. Defaults to NULL (no proportions calculated, histogram breaks regular).",
      "defaultValue": null,
      "type": "STRING"
    },
	{
      "id": "gap_adapt",
      "name": "Adapt duration stats for regular data gaps?",
      "description": "If your data were collected with a regular daily gap (e.g. no locations at night), it might be useful to work with the adapted timelag2 that is weighting the last location before the gap with the median data resolution instead of the long gap time interval. Depending on your required data property and how the animal(s) behave during the gap (e.g. night - flying or not?) either one or the other might be sensible. Note that (in addition to the Time Lag Between Locations App) you need to add the Adapt Time Lag for Regular Gaps App to your workflow before, if you want to use this feature.",
      "defaultValue": false,
      "type": "CHECKBOX"
    }
  ],
  "dependencies": {
    "R": [
      {
        "name": "move"
      },
	  {
        "name": "sp"
      },
	  {
        "name": "elevatr"
      },
	  {
        "name": "progress"
      }
    ]
  },
  "createsArtifacts": true,
  "license": {
    "key": "MIT"
  },
  "language": "eng",
  "keywords": [
    "ground elevation",
    "DEM",
	"Digital Elevation Model",
    "true altitude",
	"adapted altitude",
	"height above ground"
  ],
  "people": [
    {
     "firstName": "Andrea",
      "middleInitials": null,
      "lastName": "Kölzsch",
      "email": "akoelzsch@ab.mpg.de",
      "roles": [
        "author",
        "creator"
      ],
      "orcid": "0000-0003-0193-1563",
      "affiliation": "Max-Planck-Institute of Animal Behavior",
      "affiliationRor": "https://ror.org/026stee22"
    }
  ],
  "documentation": {
    "url": "https://github.com/movestore/Add_Elevation/blob/main/README.md"
  }
}
